correct readme mermaid syntax
